evilgenius79/Esp32-squirrel-cam/firmware_p4/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM (the P4 Nano ships with 32 MB octal PSRAM; camera buffers live there)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash: 16 MB, QIO 80 MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table with extra room for the embedded web assets
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Main task stack — handlers can spill a bit on big JSON
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512

# WiFi via remote co-processor (ESP32-C6 over SDIO, through esp_hosted)
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# lwIP tuning so MJPEG streaming doesn't stall
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# mbedTLS trimmed (HTTPS not used)
CONFIG_MBEDTLS_HAVE_TIME=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
